a = int(input("Введіть перше число:"))
b = int(input("Введіть друге число:"))
c = int(input("Введіть номер дії, яку потрібно виконати (1- сума, 2 - різниця, 3 - добуток, 4 - ділення):"))
if b != 0 and c == 4:
    rez = a / b
    print("Результат обчислення:", rez)
elif c == 3:
    rez = a * b
    print("Результат обчислення:", rez)
elif c == 2:
    rez = a - b
    print("Результат обчислення:", rez)
elif c == 1:
    rez = a + b
    print("Результат обчислення:", rez)
else:
    print("Помилка, введено некоректні дані.")

